app/controllers/guests_controller.rb

  def index
    @guests = Guest.all(:order => :ticketnumber)
---
SELECT "guests".* FROM "guests" ORDER BY ticketnumber

  def show
    @guest = Guest.find(params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT 1  [["id", "1"]]

  def checkin
    @guest = Guest.find_by_ticketnumber(params[:ticket])

    @saved = false
    if @guest != nil then
      # They have a ticket, mark them arrived
      @guest.arrived = true
      @saved = @guest.save
---
SELECT 1 FROM "guests" WHERE ("guests"."ticketnumber" = 6 AND "guests"."id" != 6) LIMIT 1
UPDATE "guests" SET "arrived" = 't', "updated_at" = '2011-12-02 18:54:21.935188' WHERE "guests"."id" = 1

  def checkout
    if params[:ticket].nil? then
      @guests = Guest.all
      @guests.each do |guest|
        guest.arrived = false
        guest.save
      end
      respond_to do |format|
        format.html { redirect_to guests_path }
        format.json { render head :ok }
      end
    else
      @guest = Guest.find_by_ticketnumber(params[:ticket])
---
SELECT "guests".* FROM "guests"
UPDATE "guests" SET "arrived" = 'f', "updated_at" = '2011-12-02 20:36:37.458288' WHERE "guests"."id" = 1
SELECT 1 FROM "guests" WHERE ("guests"."ticketnumber" = 6 AND "guests"."id" != 6) LIMIT 1

  def massadd
    csv = params[:csv]
    avail = !csv.nil?

    failures = Array.new

    if avail then
      csv.each_line do |line|
        parts = line.split(',')
        if parts.length == 4 then
          if parts.at(0).length > 0 and parts.at(2).length > 0 then
            first = Guest.new(:name => parts.at(0), :ticketnumber => parts.at(2).to_i, :arrived => false, :wonprize => false)
            if !first.save then
              failures << first.name + ": " + first.errors.reduce("") { |memo, obj| memo + " " + obj.to_s }
            end
          end
          if parts.at(1).length > 0 and parts.at(3).length > 0 then
---
INSERT INTO "guests" ("arrived", "created_at", "name", "ticketnumber", "updated_at") VALUES (?, ?, ?, ?, ?)  [["arrived", false], ["created_at", Sat, 03 Dec 2011 01:16:43 UTC +00:00], ["name", "Chris Hossenlopp"], ["ticketnumber", 0], ["updated_at", Sat, 03 Dec 2011 01:16:43 UTC +00:00]]
SELECT 1 FROM "guests" WHERE "guests"."ticketnumber" = 0 LIMIT 1

  def raffle
    @guests = Guest.where(:wonprize => false, :arrived => true)
    if @guests.count > 0 then
---
SELECT "guests".* FROM "guests" WHERE "guests"."wonprize" = 'f' AND "guests"."arrived" = 't' LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "guests" WHERE "guests"."wonprize" = 'f' AND "guests"."arrived" = 't'

  def edit
    @guest = Guest.find(params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @guest = Guest.new(params[:guest])

    respond_to do |format|
      if @guest.save
---
INSERT INTO "guests" ("arrived", "created_at", "name", "ticketnumber", "updated_at") VALUES (?, ?, ?, ?, ?)  [["arrived", false], ["created_at", Fri, 02 Dec 2011 18:53:30 UTC +00:00], ["name", "Daniel Joseph"], ["ticketnumber", 1], ["updated_at", Fri, 02 Dec 2011 18:53:30 UTC +00:00]]

  def update
    @guest = Guest.find(params[:id])

    respond_to do |format|
      if @guest.update_attributes(params[:guest])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT 1  [["id", "checkin"]]
UPDATE "guests" SET "name" = 'Chris Hossenlopp', "arrived" = 'f', "updated_at" = '2011-12-02 23:22:30.869099' WHERE "guests"."id" = 1

  def destroy
    @guest = Guest.find(params[:id])
    @guest.destroy
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT 1  [["id", "27"]]
DELETE FROM "guests" WHERE "guests"."id" = ?  [["id", 27]]